src/InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/CommonModules/влн_ДопРеквизиты/Ext/Module.bsl
Функция УстановитьЗначениеДопРеквизита(объект, имяРеквизита, значение) ЭКСПОРТ
	
	нСтр = неопределено;
	
	Для Каждого стр из объект.ДополнительныеРеквизиты Цикл
		Если стр.Свойство.Заголовок = ИмяРеквизита Тогда
			нСтр = стр;
		КонецЕсли;
	КонецЦикла;
	
	Если нСтр = неопределено Тогда
		нСтр = объект.ДополнительныеРеквизиты.Добавить();
		нСтр.Свойство = НайтиДопРеквизит(имяРеквизита);
	КонецЕсли;
	
	нСтр.Значение = значение;
КонецФункции


Функция УстановитьЗначениеДопСведения(объект, имяРеквизита, значение) ЭКСПОРТ
	допСведение = НайтиДопСведение(имяРеквизита);
	
	запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	
	запись.Объект = объект; 
	запись.Свойство = допСведение;
	запись.Значение = значение;
	
	запись.Записать(истина);
КонецФункции


Функция ПолучитьДопРеквизит(Ссылка, ИмяРеквизита)ЭКСПОРТ
	Если 1=2 Тогда Ссылка = Справочники.Партнеры.ПустаяСсылка(); КонецЕсли;
	
	Для Каждого стр из Ссылка.ДополнительныеРеквизиты Цикл
		Если стр.Свойство.Заголовок = ИмяРеквизита Тогда
			Возврат стр.Значение;
		КонецЕсли;
	КонецЦикла;
КонецФункции


Функция ПолучитьДопСведение(Ссылка, ИмяСведения)ЭКСПОРТ
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Объект = &Ссылка
	               |	И ДополнительныеСведения.Свойство.Заголовок = &ИмяСведения";
	Запрос.УстановитьПараметр("ИмяСведения",ИмяСведения);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Значение;
	КонецЕсли;
	
КонецФункции




Функция НайтиДопРеквизит(имяРеквизита)
	Результ = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.Заголовок = &Заголовок
	               |	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = Ложь";
	Запрос.УстановитьПараметр("Заголовок", имяРеквизита);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Результ = рез.Ссылка;
	КонецЕсли;
	
	Возврат Результ;
КонецФункции

Функция НайтиДопСведение(имяСведения)
	Результ = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.Заголовок = &Заголовок
	               |	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	Запрос.УстановитьПараметр("Заголовок", имяСведения);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Результ = рез.Ссылка;
	КонецЕсли;
	
	Возврат Результ;
КонецФункции
